{"inputs":{"tag":"Cuts","patterns":["What to do if Cuts?","How to cure Cuts?","Which medicine to apply for Cuts?","what to apply on cuts?","Cuts"]},"outputs":{"responses":["Wash the cut properly to prevent infection and stop the bleeding by applying pressure for 1-2 minutes until bleeding stops. Apply petroleum jelly to keep the wound moist for quick healing and cover with a sterile bandage. Pain relievers like acetaminophen can also help."],"context_set":"First aid instructions for cuts."}}
{"inputs":{"tag":"Abrasions","patterns":["how do you treat abrasions?","Do Abrasions cause scars?","Abrasions","what to do if abrasions?","Which medicine to apply for abrasions?","How to cure abrasions?"]},"outputs":{"responses":["Begin by washing your hands and gently cleaning the area with cool to lukewarm water and mild soap. Remove any dirt with sterilized tweezers. For a mild scrape that isn’t bleeding, leave it uncovered; if bleeding, apply gentle pressure with a clean cloth or bandage. Then cover with a thin layer of topical antibiotic ointment and a clean bandage. Change the dressing once a day and watch for signs of infection."],"context_set":"First aid instructions for abrasions."}}
{"inputs":{"tag":"stings","patterns":["How do you treat Sting?","Stings","What to do if you get a sting?","Which medicine to apply if sting?"]},"outputs":{"responses":["Remove any stingers immediately. Scrape out the stinger with a credit card if needed. Apply an ice pack (wrapped in a cloth) for 20 minutes every hour as needed. Use an antihistamine like diphenhydramine (Benadryl) for itching, and wash the area with soap and water."],"context_set":"First aid instructions for stings."}}
{"inputs":{"tag":"Splinter","patterns":["How to remove Splinters","How to cure Splinters?","What to do if I have splinters?","How do you bring a splinter to the surface?"]},"outputs":{"responses":["Soak the affected area in a warm bath with Epsom salts or apply a warm compress. Alternatively, try soaking the area in olive oil or white vinegar for 20-30 minutes to help draw the splinter out. Use sterilized tweezers to remove it once it is visible."],"context_set":"First aid instructions for splinters."}}
{"inputs":{"tag":"Sprains","patterns":["How do you treat a sprain?","what to do if i get a sprain?","Which cream to apply if i get a sprain?","Which medicine to apply if I get a sprain?"]},"outputs":{"responses":["Apply an ice pack for 15-20 minutes every few hours and compress the area with an elastic bandage. Keep the injured area elevated. Over-the-counter pain relievers such as ibuprofen or acetaminophen can help manage pain."],"context_set":"First aid instructions for sprains."}}
{"inputs":{"tag":"Strains","patterns":["How do you treat a strain?","what to do if i get a strain?","Which cream to apply if i get a strain?","Which medicine to apply if I get a strain?","How do you diagnose a strain?","Is heat or ice better for a pulled muscle?"]},"outputs":{"responses":["Rest the muscle and apply ice for the first 48 hours to reduce swelling. After that, alternate with heat to help relax the muscle. Over-the-counter pain relievers and gentle stretching may also be beneficial."],"context_set":"First aid instructions for strains."}}
{"inputs":{"tag":"Fever","patterns":["How do you treat a mild Fever?","what to do if i get a mild fever?","Which medicine to take if I get a mild fever?","fever"]},"outputs":{"responses":["To treat a mild fever at home, drink plenty of fluids, dress in lightweight clothing, and use a light blanket if you feel chilled. Over-the-counter medications like acetaminophen or ibuprofen can help lower the temperature. Seek medical advice if the fever persists."],"context_set":"First aid instructions for fever."}}
{"inputs":{"tag":"Nasal Congestion","patterns":["How do you treat nasal Congestion?","what to do if i get a nasal congestion?","Which medicine to take if I have a nasal congestion?","what to do if i have a blocked nose?","How do you treat a blocked nose?","How long does nasal congestion last?"]},"outputs":{"responses":["Use a humidifier to moisten the air, drink plenty of fluids to thin mucus, and apply a warm, wet towel on your face to relieve discomfort. Saline nasal sprays can also help clear congestion."],"context_set":"First aid instructions for nasal congestion."}}
{"inputs":{"tag":"Cough","patterns":["How to cure cough?","How do you treat cough?","what to do if i get a cough?","Which medicine to take if I get cough?","How do you get rid of cough?"]},"outputs":{"responses":["Mix 2 teaspoons of honey with warm water or herbal tea and drink it 1-2 times a day. Ginger tea and staying hydrated can also help soothe a cough. Avoid giving honey to children under 1 year old."],"context_set":"First aid instructions for cough."}}
{"inputs":{"tag":"Sore Throat","patterns":["How do you treat sore throat?","what to do if i get a sore throat?","Which medicine to take if I get a sore throat?","How to cure sore throat?"]},"outputs":{"responses":["Rest your voice, drink warm liquids, and gargle with salt water. Inhale steam from a hot shower to relieve throat irritation, and sip on warm tea with honey (not for infants under 12 months)."],"context_set":"First aid instructions for sore throat."}}
{"inputs":{"tag":"Gastrointestinal problems","patterns":["How do you treat gas problems?","what to do if i have Gastrointestinal problems?","Which medicine to take if I get gas problem?","How to cure Gas problems?"]},"outputs":{"responses":["Stay hydrated and avoid spicy or greasy foods. Over-the-counter antacids may help relieve discomfort, but if symptoms persist or worsen, consult a healthcare professional."],"context_set":"First aid instructions for gastrointestinal problems."}}
{"inputs":{"tag":"Skin problems","patterns":["How do you treat Skin problems?","what to do if i get a skin allergy?","Which medicine to take if I get a skin allergy?","How to cure skin allergy?"]},"outputs":{"responses":["Apply hydrocortisone cream or calamine lotion to the affected area, and consider taking an antihistamine to reduce itching. If the reaction worsens, seek medical advice."],"context_set":"First aid instructions for skin problems."}}
{"inputs":{"tag":"Abdonominal Pain","patterns":["How do you treat Abdonominal Pain?","what to do if i get a Abdonominal Pain?","Which medicine to take if I get a Abdonominal Pain?","How to cure Abdonominal Pain?"]},"outputs":{"responses":["Provide clear fluids and bland foods like crackers, toast, or rice until symptoms improve. Avoid spicy or greasy foods and caffeinated beverages for at least 48 hours. If pain persists, consult a doctor."],"context_set":"First aid instructions for abdominal pain."}}
{"inputs":{"tag":"Bruises","patterns":["How do you treat Bruises?","what to do if i get a Bruise?","Which medicine to take if I get a Bruise?","How to cure Bruises?"]},"outputs":{"responses":["Apply an ice pack wrapped in a towel to the bruise for 10-20 minutes several times a day. If swelling persists, compress the area with an elastic bandage."],"context_set":"First aid instructions for bruises."}}
{"inputs":{"tag":"Broken Toe","patterns":["How do you treat a Broken Toe?","what to do if i get a Broken Toe?","Which medicine to take if I get a Broken Toe?","How to cure Broken Toe?"]},"outputs":{"responses":["Elevate the foot, apply ice to reduce swelling, and rest the toe. If the fracture is severe, medical intervention may be required to realign the toe or perform surgery."],"context_set":"First aid instructions for broken toe."}}
{"inputs":{"tag":"Choking","patterns":["How do you treat Choking?","what to do if i get a Choke?","Which medicine to take if I get Choked?","How to cure Choking?"]},"outputs":{"responses":["Encourage the person to continue coughing to clear the obstruction. If coughing fails, perform back blows and abdominal thrusts, and seek emergency assistance immediately."],"context_set":"First aid instructions for choking."}}
{"inputs":{"tag":"Wound","patterns":["How do you treat a wound?","what to do if i get a Wound?","Which medicine to take if I get wounded?","How to cure a wound?"]},"outputs":{"responses":["Rinse the wound with clean water and apply pressure using a sterile gauze or clean cloth to stop the bleeding. Once bleeding stops, cover the wound with a fresh bandage. Seek medical help if the wound is deep or shows signs of infection."],"context_set":"First aid instructions for wounds."}}
{"inputs":{"tag":"Diarrhea","patterns":["How do you treat Diarrhea?","what to do if i get Diarrhea?","Which medicine to take if I get Diarrhea?","How to cure Diarrhea?"]},"outputs":{"responses":["Stay hydrated by drinking water or an electrolyte solution. Avoid dairy products and seek medical advice if diarrhea persists for more than 2 days."],"context_set":"First aid instructions for diarrhea."}}
{"inputs":{"tag":"Frost bite","patterns":["How do you treat a Frost bite?","what to do if i get a Frost bite?","Which medicine to take if I get a Frost bite?","How to cure Frost bite?"]},"outputs":{"responses":["Move the person to a warm area immediately. Gently warm the affected area using warm (not hot) water—ideally between 104°F and 107°F—for 15-30 minutes. Do not rub the skin, and seek medical attention as soon as possible."],"context_set":"First aid instructions for frost bite."}}
{"inputs":{"tag":"Heat Exhaustion","patterns":["How do you treat Heat Exhaustion?","what to do if i feel Exhausted due to heat?","Which medicine to take if I get Exhausted?","How to cure Heat Exhaustion?"]},"outputs":{"responses":["Move the person to a cooler environment and have them rest. Encourage fluid intake—preferably water or an electrolyte solution—and apply cool compresses. If symptoms do not improve, seek medical help."],"context_set":"First aid instructions for heat exhaustion."}}
{"inputs":{"tag":"Heat Stroke","patterns":["How do you treat Heat Stroke?","what to do if i get a Heat Stroke?","Which medicine to take if I get Stroke?","How to cure a Heat Stroke?"]},"outputs":{"responses":["Heat stroke is a medical emergency. Immediately move the person to a cooler place, call emergency services, and start cooling them down with water and ice packs. Monitor their condition closely until help arrives."],"context_set":"First aid instructions for heat stroke."}}
{"inputs":{"tag":"Insect Bites","patterns":["How do you treat a Insect Bite?","what to do if a insect bites me?","Which medicine to take if I get bitten by an insect?","How to cure insect bite?"]},"outputs":{"responses":["Clean the bite area with soap and water, apply a cold compress to reduce swelling, and use an over-the-counter antihistamine to alleviate itching. If the bite shows signs of a severe reaction, seek medical care."],"context_set":"First aid instructions for insect bites."}}
{"inputs":{"tag":"nose bleed","patterns":["How do you treat a bleeding nose?","what to do if i my nose is bleeding?","Which medicine to take if I get nose bleed?","How to cure nose bleeding?"]},"outputs":{"responses":["Have the person sit upright and lean forward slightly. Gently pinch the soft part of the nose for about 10 minutes, and avoid blowing the nose afterward. If bleeding continues, consult a healthcare professional."],"context_set":"First aid instructions for nose bleeds."}}
{"inputs":{"tag":"Pulled Muscle","patterns":["How do you treat a Pulled Muscle?","what to do if my muscle is pulled?","Which medicine to take if I got pulled muscle?","How to cure a pulled muscle?"]},"outputs":{"responses":["Rest the affected muscle and apply ice for 15-20 minutes every hour during the first 48 hours. After the swelling subsides, gentle stretching and heat application may help relieve stiffness. If pain persists, consult a doctor."],"context_set":"First aid instructions for a pulled muscle."}}
{"inputs":{"tag":"Rectal bleeding","patterns":["How do you treat Rectal Bleeding?","what to do if i get a Rectal Bleeding?","Which medicine to take if I Get Rectal Bleeding?","How to cure Rectal Bleeding?"]},"outputs":{"responses":["Rectal bleeding can be serious. If it occurs, have the person sit down and apply gentle pressure. It is important to seek immediate medical attention to diagnose and treat the underlying cause."],"context_set":"First aid instructions for rectal bleeding."}}
{"inputs":{"tag":"Sun Burn","patterns":["How do you treat Sun Burn?","what to do if i get a Sun Burn?","Which medicine to take if I Get Sun Burn?","How to cure a Sun Burn?"]},"outputs":{"responses":["Cool the sunburned area with a cool shower or compresses. Apply aloe vera or a moisturizing lotion to soothe the skin and stay hydrated. Over-the-counter pain relievers can help manage discomfort. Avoid further sun exposure."],"context_set":"First aid instructions for sun burn."}}
{"inputs":{"tag":"Testicle Pain","patterns":["How do you treat Testicle Pain?","what to do if i get a Testicle Pain?","Which medicine to take if I get a Testicle Pain?","How to cure Testicle Pain?"]},"outputs":{"responses":["For minor testicle pain, apply a cold pack wrapped in a cloth to reduce swelling and rest. Wear supportive underwear and avoid strenuous activities. If pain is severe or persistent, seek immediate medical evaluation."],"context_set":"First aid instructions for testicle pain."}}
{"inputs":{"tag":"Vertigo","patterns":["How do you treat a Vertigo?","what to do if i get a Vertigo?","Which medicine to take if I get Vertigo?","How to cure a Vertigo?"]},"outputs":{"responses":["Have the person sit or lie down in a safe, quiet place until the dizziness passes. Avoid sudden head movements and encourage slow, deliberate movements. If vertigo persists or worsens, consult a healthcare provider."],"context_set":"First aid instructions for vertigo."}}
{"inputs":{"tag":"Normal Bleeding","patterns":["How do you treat bleeding?","what to do if i get a Bleeding?","Which medicine to take if I get bleeding?","How to cure Bleeding?"]},"outputs":{"responses":["For minor bleeding, apply direct pressure with a clean cloth or bandage and elevate the injured area if possible. If bleeding does not stop, seek medical help."],"context_set":"First aid instructions for normal bleeding."}}
{"inputs":{"tag":"Eye Injury","patterns":["How do you treat an eye Injury?","what to do if i get a eye Injury?","Which medicine to take if I injured my eye?","How to cure injured eye?"]},"outputs":{"responses":["For minor eye injuries, gently flush the eye with clean water to remove any debris. Avoid rubbing the eye and seek immediate medical advice if you experience pain, vision changes, or persistent irritation."],"context_set":"First aid instructions for eye injury."}}
{"inputs":{"tag":"Chemical Burn","patterns":["How do you treat a chemical burn?","what to do if i get a Chemical Burn?","Which medicine to take if I get burn due to chemicals?","How to cure Chemical Burn?"]},"outputs":{"responses":["Immediately flush the affected area with plenty of water for at least 15 minutes. Remove any contaminated clothing and seek emergency medical care, as chemical burns can be severe."],"context_set":"First aid instructions for chemical burns."}}
{"inputs":{"tag":"Poison","patterns":["How do you treat a Poison?","what to do if i get Poison?","Which medicine to take if I am poisoned?","How to cure Poisoning?"]},"outputs":{"responses":["If poisoning is suspected, immediately call emergency services or your local poison control center. Do not induce vomiting unless instructed by a professional, and provide as much detail as possible about the substance involved."],"context_set":"First aid instructions for poisoning."}}
{"inputs":{"tag":"Teeth","patterns":["How do you treat broken Teeth ?","what to do if my Teeth got broken?","Which medicine to take if I get broken teeth?","cure broken teeth?"]},"outputs":{"responses":["If a tooth is chipped, rinse your mouth with warm water and apply a cold compress to reduce swelling. For a knocked-out tooth, try to preserve it in milk or saline and seek emergency dental care immediately."],"context_set":"First aid instructions for broken teeth."}}
{"inputs":{"tag":"seizure","patterns":["How do you treat a seizure?","what to do if i get a seizure?","Which medicine to take if I get seizure?","How to cure seizure?"]},"outputs":{"responses":["Clear the area of any hazards and gently help the person to the ground if needed. Place them on their side to keep the airway clear and time the seizure. Do not restrain them. Seek emergency help if the seizure lasts longer than 5 minutes or if the person is injured."],"context_set":"First aid instructions for seizures."}}
{"inputs":{"tag":"Head Injury","patterns":["How do you treat a head Injury?","what to do if i get a Head Injury?","Which medicine to take if I get injured in the head?","How to cure Head Injury?"]},"outputs":{"responses":["Monitor the person for signs of concussion such as confusion, dizziness, or vomiting. Keep them resting and avoid strenuous activities. If symptoms worsen or include loss of consciousness, seek immediate medical attention."],"context_set":"First aid instructions for head injuries."}}
{"inputs":{"tag":"Fainting","patterns":["How do you treat Faint?","what to do if i feel like Fainting?","Which medicine to take if I get a Faint?","How to cure Fainting?"]},"outputs":{"responses":["Have the person lie down and elevate their legs to improve blood flow to the brain. Loosen tight clothing and monitor their condition. If fainting recurs or is accompanied by chest pain or breathing difficulties, seek medical help immediately."],"context_set":"First aid instructions for fainting."}}
{"inputs":{"tag":"Headache","patterns":["How do you treat a mild Headache?","what to do if i get a mild Headache?","Which medicine to take if I have a mild headache?","How to cure a mild headache?"]},"outputs":{"responses":["Give ibuprofen, aspirin, or acetaminophen for pain relief. Avoid NSAIDs if there are contraindications such as heart or kidney issues, and do not give aspirin to children under 18."],"context_set":"First aid instructions for headaches."}}
{"inputs":{"tag":"Cold","patterns":["How do you treat a Cold?","what to do if i get a mild Cold?","Which medicine to take if I have a Cold?","How to cure Cold?"]},"outputs":{"responses":["Stay well-hydrated and rest. Increase your intake of vitamin C-rich foods and consider vitamin D supplementation to support your immune system. Over-the-counter cold remedies may also help relieve symptoms."],"context_set":"First aid instructions for cold."}}
{"inputs":{"tag":"Rash","patterns":["How do you treat Rashes?","what to do if i get a Rash?","Which medicine to take if I have a Rash?","How to cure Rash?"]},"outputs":{"responses":["Apply olive oil to soothe and promote skin renewal, use baking soda to relieve itching and inflammation, and consider aloe vera for its antibacterial and anti-inflammatory properties. Monitor the rash and consult a doctor if it worsens."],"context_set":"First aid instructions for rash."}}
{"inputs":{"tag":"snake bite","patterns":["How do you treat a snake bite?","what to do if i get a snake bite?","Which medicine to take if I get a snake bite?","How to cure snake bite?","i got bit by a snake"]},"outputs":{"responses":["Move the person away from the snake and have them lie down with the bite area below the heart. Keep them calm and apply a loose, sterile bandage to the wound. Remove any jewelry near the bite site and seek immediate medical attention."],"context_set":"First aid instructions for snake bites."}}
{"inputs":{"tag":"animal bite","patterns":["How do you treat a animal bite?","How do you treat a monkey bite?","How do you treat a dog bite?","what to do if i get a animal bite?","Which medicine to take if I get a monekey bite?","How to cure dog bite?","i got bit by a dog"]},"outputs":{"responses":["Clean the bite wound thoroughly with soap and water. Apply an antibacterial ointment and cover with a sterile bandage. Monitor for signs of infection, and if the bite is severe or there’s a risk of rabies, seek medical help immediately."],"context_set":"First aid instructions for animal bites."}}
{"inputs":{"tag":"Drowning","patterns":["What to do if someone is Drowning?","what to do if someone drowned?","What steps to take if i see a drowning person?","How to help a drowning person?"]},"outputs":{"responses":["Place your ear near the person’s mouth to check for breathing and look for chest movement. If there is no breathing, check for a pulse and begin CPR if necessary. Call emergency services immediately."],"context_set":"First aid instructions for drowning."}}
{"inputs":{"tag":"CPR","patterns":["How to give CPR??","what to do in a CPR?","What steps to take in a CPR??","How to help a drowning person in CPR?"]},"outputs":{"responses":["For an adult or child, place the heel of one hand on the center of the chest and the other hand on top, then press down at least 2 inches at a rate of 100-120 compressions per minute. For an infant, use two fingers on the chest. Allow the chest to rise completely between compressions and check for breathing periodically."],"context_set":"First aid instructions for CPR."}}
{"inputs":{"tag":"Fracture","patterns":["How do you treat a Fracture?","what to do if i get a Fracture?","Which medicine to take if I have a Fracture?","How to cure a Fracture?"]},"outputs":{"responses":["Stop any bleeding by applying pressure with a clean cloth, and immobilize the injured area using a splint. Apply ice to reduce swelling, and avoid attempting to realign the bone. Seek medical attention promptly to prevent complications."],"context_set":"First aid instructions for fractures."}}
